
{
  "users": {},
  "courses": {},
  "enrollments": {},
  "assignments": {},
  "submissions": {},
  "discussion_threads": {},
  "discussion_posts": {},
  "materials": {},
  "notifications": {},
  "attendance": {},
  "certificates": {},
  "challenges": {
    "ch1": {
      "id": "ch1",
      "title": "E-commerce Recommendation Engine",
      "description": "Design a system that recommends products to users based on their browsing history and past purchases. The solution should be scalable and handle real-time user behavior.",
      "company": "Innovate Inc.",
      "points": 100,
      "icon": "ShoppingCart"
    },
    "ch2": {
      "id": "ch2",
      "title": "Social Media Feed Algorithm",
      "description": "Develop an algorithm to create a personalized social media feed. The algorithm should balance content from friends, followed pages, and new discoveries to maximize user engagement.",
      "company": "ConnectSphere",
      "points": 120,
      "icon": "Users"
    },
    "ch3": {
      "id": "ch3",
      "title": "Live Code Collaboration Tool",
      "description": "Architect a real-time code editor that allows multiple users to edit the same file simultaneously, showing each other's cursors and selections, similar to VS Code Live Share.",
      "company": "DevSync",
      "points": 150,
      "icon": "Code"
    },
    "ch4": {
      "id": "ch4",
      "title": "Real-Time Chat Moderation AI",
      "description": "Create a service that automatically detects and flags toxic or inappropriate messages in a live chat stream using natural language processing. The system must be fast and accurate.",
      "company": "SafeTalk",
      "points": 130,
      "icon": "MessageSquare"
    },
    "ch5": {
      "id": "ch5",
      "title": "CI/CD Pipeline Optimization",
      "description": "Analyze a complex CI/CD pipeline and propose a strategy to reduce build times by 30%. Your proposal should include changes to caching, parallelization, and testing strategies.",
      "company": "QuantumLeap",
      "points": 110,
      "icon": "GitMerge"
    },
    "ch6": {
      "id": "ch6",
      "title": "Database Sharding Strategy",
      "description": "Design a sharding strategy for a rapidly growing monolithic database to improve performance and scalability. Justify your choice of sharding key and explain the data migration process.",
      "company": "DataScale",
      "points": 140,
      "icon": "Database"
    }
  },
  "challenge_submissions": {},
  "challenge_votes": {},
  "projects": {},
  "internship_domains": {
    "google": {
      "id": "google",
      "name": "Google",
      "description": "Tackle a large-scale data processing challenge inspired by the systems that power Google Search.",
      "icon": "google",
      "task": {
        "title": "Design a Web Crawler",
        "scenario": "The Search Infrastructure team wants to improve the freshness of its index. Your task is to design a new, highly-efficient web crawler that can discover and fetch billions of pages while being respectful to web servers.",
        "task": "Propose a high-level architecture for this distributed web crawling system. Consider aspects like URL frontier management, politeness policies (robots.txt, crawl-delay), duplicate detection, and scalability.",
        "deliverables": [
          "A high-level system diagram.",
          "A 1-page document explaining the core components and data flow.",
          "Pseudo-code for the URL frontier management logic."
        ]
      }
    },
    "openai": {
      "id": "openai",
      "name": "OpenAI",
      "description": "Explore the ethical and technical challenges of deploying cutting-edge AI models.",
      "icon": "openai",
      "task": {
        "title": "AI Safety and Alignment Strategy",
        "scenario": "A new, powerful language model is ready for public release. The Safety & Alignment team needs a comprehensive strategy to minimize potential misuse and ensure the model's behavior remains helpful and harmless.",
        "task": "Develop a multi-layered safety strategy for the new language model. Your proposal should cover pre-deployment testing, real-time input/output filtering, and a plan for post-deployment monitoring and continuous improvement.",
        "deliverables": [
          "A 2-page strategy document outlining your proposed safety layers.",
          "A flowchart illustrating the decision-making process for flagging or blocking a user prompt.",
          "A list of 5 challenging 'red-teaming' prompts designed to test the model's safety boundaries."
        ]
      }
    },
    "netflix": {
      "id": "netflix",
      "name": "Netflix",
      "description": "Work on a challenge related to video streaming, content delivery, or recommendation systems.",
      "icon": "netflix",
      "task": {
        "title": "Adaptive Bitrate Streaming Algorithm",
        "scenario": "The video playback team is looking to improve the user experience by reducing buffering events, especially on unstable network connections. They need a smarter algorithm for adaptive bitrate (ABR) streaming.",
        "task": "Design a new ABR algorithm that goes beyond simple bandwidth estimation. Your algorithm should consider factors like network latency, buffer health, and recent bandwidth volatility to make more intelligent decisions about when to switch video quality levels.",
        "deliverables": [
          "A document explaining the logic and key heuristics of your algorithm.",
          "Pseudo-code for the core decision-making function.",
          "A description of 3 key metrics you would use to evaluate the performance of your algorithm against the current one."
        ]
      }
    },
    "microsoft": {
      "id": "microsoft",
      "name": "Microsoft",
      "description": "Engage with a problem in cloud computing, developer tools, or enterprise software.",
      "icon": "microsoft",
      "task": {
        "title": "Cloud Cost Optimization Service",
        "scenario": "Azure customers are struggling to manage their cloud spending. The Azure cost management team wants to build a new advisory service that proactively identifies potential cost savings in a customer's account.",
        "task": "Design a service that analyzes a customer's Azure resource usage (e.g., VMs, storage, databases) and provides a prioritized list of actionable cost-saving recommendations. For example, it could suggest resizing underutilized VMs or moving data to cheaper storage tiers.",
        "deliverables": [
          "A high-level architecture diagram for the service.",
          "An example of the JSON data structure for a recommendation.",
          "A list of 5 different types of cost-saving recommendations the service would detect."
        ]
      }
    },
    "aws": {
      "id": "aws",
      "name": "Amazon Web Services",
      "description": "Solve a complex cloud infrastructure problem related to scalability, reliability, or security.",
      "icon": "aws",
      "task": {
        "title": "Serverless Architecture for a High-Traffic Event",
        "scenario": "A major online retailer is planning a flash sale that is expected to generate millions of requests per minute. Their current server-based infrastructure can't handle this spike. They want to use a serverless architecture on AWS.",
        "task": "Design a serverless architecture using AWS services (like Lambda, API Gateway, DynamoDB, SQS) to handle the flash sale's massive, spiky traffic. Your design should be highly scalable, resilient, and cost-effective.",
        "deliverables": [
          "A system architecture diagram showing the flow of requests and the AWS services involved.",
          "A brief explanation of why you chose each service and its role in the system.",
          "A discussion of potential bottlenecks and how your design mitigates them."
        ]
      }
    },
    "apple": {
      "id": "apple",
      "name": "Apple",
      "description": "Focus on user experience, hardware-software integration, or privacy-preserving features.",
      "icon": "apple",
      "task": {
        "title": "Privacy-Preserving Contact Tracing Feature",
        "scenario": "In response to public health needs, the iOS team is tasked with creating a feature that allows users to know if they've been in close proximity to someone who later reports a positive health status, without compromising anyone's identity or location data.",
        "task": "Design a system that uses Bluetooth to exchange anonymous, rotating identifiers between devices. Explain how this system can notify a user of potential exposure without a central server ever knowing who was exposed or where it happened.",
        "deliverables": [
          "A document detailing the cryptographic protocol for generating and exchanging anonymous keys.",
          "A sequence diagram showing how a user reports a positive status and how others are notified.",
          "An explanation of the privacy guarantees your system provides."
        ]
      }
    },
    "meta": {
      "id": "meta",
      "name": "Meta",
      "description": "Work on a problem related to social networking, virtual reality, or large-scale infrastructure.",
      "icon": "meta",
      "task": {
        "title": "News Feed Content Ranking Strategy",
        "scenario": "The News Feed team wants to improve user satisfaction by showing more relevant and meaningful content. The goal is to move beyond simple engagement metrics (likes, clicks) and incorporate signals that indicate high-quality content.",
        "task": "Propose a new ranking strategy for the News Feed. Your strategy should define what 'high-quality content' means (e.g., informative, from close friends, sparks conversation) and describe how you would use machine learning to predict these qualities and rank posts accordingly.",
        "deliverables": [
          "A 1-page document defining your ranking philosophy and the signals you would use.",
          "A list of 5 features you would engineer for your machine learning model.",
          "A description of an A/B test you would run to validate that your new ranking strategy improves user satisfaction."
        ]
      }
    }
  }
}
